In [1]:
import pandas as pd
df = pd.read_csv('customer_data.csv')
dfov = pd.read_csv('customer_data_only_valid.csv')
dfov.head()

,name,age,email,phone,purchase_frequency
0,Jasper Jenkins,53,jasper.jenkins@distansakademin.se,0720-124179,high
1,Jenny Jöhanssön,56,jenny.johansson@distansakademin.se,0787-816236,medium
2,Jesse Smith,34,jesse.smith@distansakademin.se,0715-227082,high
3,Jöe Smith,51,joe.smith@distansakademin.se,0768-973470,medium
4,Jack Jacksön,18,jack.jackson@distansakademin.se,0733-550714,high

In [2]:
#Information om vår data 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   name                100 non-null    object
 1   age                 100 non-null    object
 2   phone               100 non-null    object
 3   email               100 non-null    object
 4   purchase_frequency  100 non-null    object
dtypes: object(5)
memory usage: 4.0+ KB

In [3]:
df.describe()

,name,age,phone,email,purchase_frequency
count,100,100,100,100,100
unique,25,33,100,25,3
top,Alice Alexandre,invalid_age,074--113555,alice.alexandre@distansakademin.se,high
freq,7,25,1,7,37

In [4]:
dfov['purchase_frequency']

0         high
1       medium
2         high
3       medium
4         high
         ...
9995    medium
9996    medium
9997    medium
9998       low
9999      high
Name: purchase_frequency, Length: 10000, dtype: object

In [6]:
dfov['purchase_frequency'].value_counts()

high      3354
medium    3327
low       3319
Name: purchase_frequency, dtype: int64

In [7]:
dfov['age'].value_counts()

invalid_age    1658
50              208
61              200
33              194
31              194
37              194
28              194
42              189
36              188
49              187
56              186
29              185
59              183
39              183
53              183
58              182
51              182
22              181
25              181
21              179
41              179
43              176
34              175
40              175
20              173
18              172
63              172
30              172
64              171
65              170
46              169
47              168
27              168
19              167
24              167
32              165
60              161
45              160
35              159
57              159
54              158
52              157
26              155
62              155
48              155
55              154
38              154
23              153
44              150
Name: age, dtype: int64

In [8]:
df.tail()

,name,age,phone,email,purchase_frequency
95,Alice Smith,34,071--368124,alice.smith@distansakademin.se,medium
96,Liselle Alexandre,invalid_mail,073--787977,liselle.alexandre@distansakademin.se,low
97,Rafael Larsson,62,072--710327,rafael.larsson@distansakademin.se,low
98,Alice Smith,57,075--147018,alice.smith@distansakademin.se,medium
99,Liselle Jackson,51,075--844361,liselle.jackson@distansakademin.se,high

In [9]:
df.shape #antal rader[1]antal kolumner[0]

(100, 5)

In [10]:
df.dtypes

name                  object
age                   object
phone                 object
email                 object
purchase_frequency    object
dtype: object

In [11]:
df.nunique() #alla unika t.ex mail addresser, många delar just nu

name                   25
age                    33
phone                 100
email                  25
purchase_frequency      3
dtype: int64

In [12]:
df.isna().sum() #antal rader med nan värden

name                  0
age                   0
phone                 0
email                 0
purchase_frequency    0
dtype: int64

In [14]:
df[df['email'] == 'invalid_mail']

Empty DataFrame
Columns: [name, age, phone, email, purchase_frequency]
Index: []

In [15]:
df[df['phone'].str.contains('073-')]

,name,age,phone,email,purchase_frequency
31,Charlie Jackson,invalid_mail,073--620280,charlie.jackson@distansakademin.se,high
39,Alice Jackson,invalid_age,073--800131,alice.jackson@distansakademin.se,low
72,Liselle Larsson,54,073--412394,liselle.larsson@distansakademin.se,high
73,Charlie Becker,52,073--626920,charlie.becker@distansakademin.se,low
79,Rafael Smith,invalid_age,073--620536,rafael.smith@distansakademin.se,medium
80,Rafael Alexandre,invalid_mail,073--493550,rafael.alexandre@distansakademin.se,high
81,Rafael Jackson,21,073--893589,rafael.jackson@distansakademin.se,medium
88,Bob Larsson,46,073--439795,bob.larsson@distansakademin.se,medium
96,Liselle Alexandre,invalid_mail,073--787977,liselle.alexandre@distansakademin.se,low